tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

cask "adoptopenjdk" # needed for sbt
# you might need to run: brew cask reinstall --no-quarantine adoptopenjdk
brew "R"
brew "autojump"
brew "awscli"
brew "boot2docker"
brew "curl"
brew "fish"
brew "ffmpeg"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "hg"
brew "htop-osx"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "legit"
brew "memcached"
brew "mackup"
brew "mono"
brew "moreutils"
brew "mysql"
brew "neovim"
brew "node"
brew "ohcount"
brew "p7zip"
brew "postgresql"
brew "pv"
brew "pwgen"
brew "python"
brew "q"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "sbt"
brew "siege"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "youtube-dl"

cask "anki"
cask "caffeine"
cask "cheatsheet"
cask "cyberduck"
cask "docker"
cask "gas-mask"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "keycastr"
cask "licecap"
cask "linein"
cask "macvim"
cask "obs"
cask "slack"
cask "sketch"
cask "soulver"
cask "spectacle"
cask "tripmode"
cask "webstorm"
cask "whatsapp"
cask "zoomus"

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-roboto'

mas "DaisyDisk", id: 411643860
mas "Day One Classic", id: 422304217
mas "LastPass", id: 926036361
mas "MindNode 5", id: 1289197285
