tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "harelba/q"

brew "autojump"
brew "awscli"
brew "bat"
brew "curl"
brew "direnv"
brew "deno"
brew "fd"
brew "fish"
brew "fisher"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mackup"
brew "moreutils"
brew "neovim"
brew "node"
brew "ohcount"
brew "p7zip"
brew "postgresql"
brew "pv"
brew "pwgen"
brew "python"
brew "q"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "fnm"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "yt-dlp"

cask "1password"
cask "1password-cli"
cask "anki"
cask "caffeine"
cask "cheatsheet"
cask "cyberduck"
cask "docker"
cask "gas-mask"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "keycastr"
cask "licecap"
cask "macvim"
cask "obs"
cask "rectangle"
cask "slack"
cask "soulver"
cask "whatsapp"
cask "zettlr"
cask "zoom"

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-roboto'

mas "DaisyDisk", id: 411643860
mas "Day One Classic", id: 422304217
mas "Keynote", id: 409183694
mas "MindNode 5", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speeko", id: 1071468459
mas "Things", id: 904280696
mas "TripMode", id: 1513400665
